{
  "Bubble Sort": "1. Vergleiche zwei benachbarte Elemente und tausche sie, wenn das linke Element größer ist als das rechte. Angefangen wird mit den Elementen in Position 1 und 2.\n2. Wiederhole Schritt 1 mit den Elementen in Position 2 und 3, dann mit denen in Position 3 und 4, usw. Dies wird so lange wiederholt, bis man beim letzten Element angekommen ist, d.h. das größte Element befindet sich nun ganz am Ende und muss beim nächsten Schritt 2 nicht wieder getauscht werden.\n3. Wiederhole Schritt 1 und 2 so lange, bis keine Elemente mehr getauscht werden müssen.\n - Wie Blubberblasen (bubbles) im Wasser steigt also bei jedem Durchgang das größte Element zum Ende auf.",
  "Insertion Sort": "1. Merke dir die erste Karte als Teil des sortierten Elements.\n2. Wähle die nächste Karte aus und füge sie an der richtigen Stelle in das sortierte Element ein, d.h. vertausche sie so lange mit der Karte links davon, bis das Element wieder sortiert ist.\n3. Wiederhole Schritt 2 für alle Karten. Das heißt nimm immer die nächste Karte, welche noch nicht im sortierten Teil ist, und vergleiche sie mit der Karte eins weiter links. Ist unsere Karte kleiner, wird vertauscht und mit der nächsten Karte weiter links verglichen, bis die Karte an der richtigen Stelle angekommen ist. \n - Es wird also immer die nächste Karte genommen, und durch paarweises Vertauschen von rechts aus in den sortierten Teil eingefügt, bis sie an der korrekten Stelle eingesetzt (inserted) wurde.",
  "Selection Sort": "1. Durchsuche die Karten nach dem kleinsten Element und tausche es mit der Karte in Position 1.\n2. Suche nun das nächst kleinste Element und tausche es mit der Karte in Position 2.\n3. Wiederhole Schritt 2 für alle Karten.\n - Es wird also immer das kleinste Element der Reihe gesucht (selected) und dann mit dem Element an der korrekten Position vertauscht.",
  "Quick Sort": "1. Wähle zuerst durch Drücken auf 'Pivotelement' ein Pivotelement aus.\n2. Decke Schritt für Schritt die nächste Karte auf, und teile somit die Menge der Karten in zwei, indem kleinere Elemente durch Drücken von 'kleiner' links vom Pivotelement abgelegt werden, und größere durch Drücken von 'größer' rechts bleiben. Das Pivotelement ist nun in der korrekten Position. (Jede kleinere Karte ist links, jede größere ist rechts.)\n3. Wähle nun ein neues Pivotelement für eine der Unterteilungen. Wiederhole für dieses Pivotelement und diese Unterteilung Schritt 2.\n4. Immer wenn du am Ende der unsortierten Karten einer Teilung angekommen bist, wähle ein neues Pivotelement. Dadurch werden die Unterteilungen immer weiter unterteilt. \n - Hat eine Unterteilung zu irgendeinem Zeitpunkt nur ein Element, dann ist dieses genau wie das Pivotelement in der richtigen Position.\n - Nach dem 'Teile und Herrsche-Prinzip' wird also die Menge der Karten immer kleiner geteilt und sortiert.",
  "Merge Sort": "1. Teile die Menge der Karten in zwei Hälften, die möglichst gleich groß sind. Wiederhole diese Teilung mit den Hälften so lange, bis jedes Teilstück nur noch ein Element enthält.\n2. Füge nun die Teilstücke zusammen, sodass jede Vereinigung zwei Karten beinhaltet (plus einen Block mit einer Karte im Fall einer ungeraden Kartenanzahl). Sortiere die Vereinigungen alle jeweils für sich.\n3. Füge nun zwei der Vereinigungen zusammen und sortiere die größere Vereinigung. Zum Sortieren vergleiche die Karte ganz links mit der Karte rechts vom grünen Strich. Vertausche sie gegebenenfalls, sodass die kleinere Karte links ist. Vergleiche dann die nächsten Karte mit der Karte rechts von Strich, bis alle Karten angeschaut wurden.\n Dadurch, dass die beiden Teilmengen schon sortiert waren, hast du das Gesamtstück so nach einem Durchlauf bereits sortiert. \n 4.Füge nun immer zwei Teilmengen zusammen und sortiere das Resultat. Um effizient zu sein, probiere dabei, immer zwei möglichst gleich große Teillisten zusammenzulegen, soweit dies möglich ist, und nicht alle Teillisten nacheinander zu der gleichen hinzuzufügen.  \n 5. Wiederhole dies, bis wieder alle Karten sortiert in einer Menge sind.",
  "Free Sort": "Deine Aufgabe ist es, die Karten in aufsteigender Reihenfolge zu sortieren. \n Die Karten enthalten Bilder mit Strichen. Kleiner bedeutet, dass eine Karte weniger Striche hat als eine andere. \n Hierfür kannst du bis zu zwei Karten aufdecken, indem du diese mit der Maus anklickst und nach dem Vergleichen vertauschst. \n Wenn du die Karten in die richtige Reihenfolge gebracht hast, klicke auf fertig sortiert, um zu überprüfen, ob du richtig sortiert hast."
}
