{
  "Bubble Sort": "1. Vergleiche die zwei benachbarten Elemente und tausche sie, wenn das linke Element größer ist als das rechte. Angefangen wird mit den ersten beiden Elementen.\n2. Wiederhole Schritt 1 mit dem zweiten und dritten Element. Dies wird solange wiederholt, bis man beim letzten Element angekommen ist, d.h. das größte Element befindet sich nun ganz am Ende.\n3. Wiederhole Schritt 1 und 2 solange, bis keine Elemente mehr getauscht werden müssen.",
  "Insertion Sort": "1. Wähle das erste Element als sortiertes Element aus.\n2. Wähle das nächste Element aus und füge es an der richtigen Stelle in das sortierte Element ein, d.h. vergleiche es mit den schon sortierten Elementen und füge es passend ein.\n3. Wiederhole Schritt 2 für alle Elemente.",
  "Selection Sort": "1. Wähle das kleinste Element aus und tausche es mit dem ersten Element.\n2. Wähle das zweitkleinste Element aus und tausche es mit dem zweiten Element.\n3. Wiederhole Schritt 2 für alle Elemente.",
  "Quick Sort": "1. Wähle das letzte Element als Pivot-Element aus.\n2. Teile die Liste in zwei Teile (linke & rechte Teilliste), sodass alle Elemente kleiner als das Pivot-Element in der linken und alle Elemente größer in der rechten Teilliste stehen.\n3. Wiederhole Schritt 2 für die beiden Teillisten, solange, bis die neu erzeugten Teillisten nur noch ein Element enthalten.",
  "Merge Sort": "1. Teile die Liste in zwei Teile. Diese Teilung wird solange fortgesetzt, bis jede Teilung nur noch ein Element enthält.\n2. Sortiere die Teillisten alle für sich.\n3. Füge die sortierten Teillisten wieder zusammen.",
  "Free Sort": "Deine Aufgabe ist es, die Karten in aufsteigender Reihenfolge zu sortieren. \n Die Karten enthalten Bilder mit Strichen. Kleiner bedeutet,dass eine Karte weniger Striche hat als eine andere. \n Du kannst die Karten in die leeren Felder ziehen und sie dort ablegen. \n Wenn du die Karten in die richtige Reihenfolge gebracht hast, klicke auf fertig sortiert, um zu überprüfen, ob du richtig sortiert hast."
}
