{
  "Bubble Sort": "1. Vergleiche die zwei benachbarten Elemente und tausche sie, wenn das linke Element größer ist als das rechte. Angefangen wird mit den ersten beiden Elementen.\n2. Wiederhole Schritt 1 mit den Elementen in Position 2 und 3, dann mit denen in Position 3 und 4, usw.. Dies wird solange wiederholt, bis man beim letzten Element angekommen ist, d.h. das größte Element befindet sich nun ganz am Ende.\n3. Wiederhole Schritt 1 und 2 solange, bis keine Elemente mehr getauscht werden müssen.\n - Wie Blubberblasen (bubbles) im Wasser steigt also bei jedem Durchgang das größte Element zum Ende auf",
  "Insertion Sort": "1. Merke dir das erste Element als sortiertes Element.\n2. Wähle das nächste Element aus und füge es an der richtigen Stelle in das sortierte Element ein, d.h. vergleiche es mit dem jeweils größten schon sortierten Elementen vertausche diese wenn nötig.\n3. Wiederhole Schritt 2 für alle Elemente. Das heißt man nimmt immer das nächste Element, welches noch nicht im sortierten Teil ist, und vergleicht es mit der Karte eins weiter links. Ist unser Element kleiner wird vertauscht und mit der nächsten Karte weiter links verglichen, bis das Element an der richtigen Stelle angekommen ist. \n - Es wird also immer das nächste Element genommen, und durch paarweises Vertauschen von rechts aus in den sortierten Teil eingefügt, bis es an der korrekten Stelle eigesetzt (inserted) wurde",
  "Selection Sort": "1. Durchduche die Karten nach dem kleinsten Element aus und tausche es mit dem Element in Position 1.\n2. Suche nun das nächstkleinste Element aus und tausche es mit dem Element in Position 2.\n3. Wiederhole Schritt 2 für alle Elemente.\n - Es wird also immer das kleinste Element der Reihe gesucht (selected) und dann mit dem Element an der korrekten Position vertauscht",
  "Quick Sort": "1. Zuerst wird durch drücken auf 'Pivotelement' ein Pivotelement ausgewählt.\n2. Gehe Schritt für Schritt durch die Liste, und teile sie in zwei Teillisten, indem kleine Elemente nach links vom Pivotelement gelegt werden, und größere rechts bleiben. Das Pivotelement ist nun in der korrekten Position (Alles kleiner ist links, Alles größer ist rechts)\n3. Wähle nun ein neues Pivotelement für eine der Teillisten. Wiederhole für dieses Pivotelement und diese Teilliste Schritt 2.\n4. Immer wenn du am Ende einer Teilliste (also am Ende der gesamten Liste oder einer schon festen Karte) angekommen bist, wähle ein neues Pivotelement. Dabei werden die Teillisten immer weiter in Teillisten unterteilt. \n - Hat eine Teilliste zu irgendeinem Zeitpunkt nur ein Element, dann ist dieses genauso wie das Pivotelement in der richtigen Position.\n - Nach dem Teile und Herrsche Prinzip wird also die Liste zerstückelt und sortiert",
  "Merge Sort": "1. Teile die Liste in zwei Teile. Diese Teilung wird solange fortgesetzt, bis jedes Teilstück nur noch ein Element enthält.\n2. Fürg nun die Teilstücke zusammen, so das jedes Teilstück zwei Karten beinhaltet. Sortiere die Teilstücke alle für sich.\n3. Füge nun zwei der Teilstücke zusammen und sortiere das Neue Teilstück. Zum sortieren vergleiche die linkeste Karte mit der Karte rechts vom grünen Strich. Vertausche sie gegebenenfalls, so das die kleinere Karte links ist. Vergleiche dann die nächstlinke Karte mit der Karte rechts von Strich, usw.\n Dadurch, dass die beiden Teillisten schon sortiert waren, hast du das Gesamtstück so nach einem Durchlauf bereits sortiert. \n 4.füge nun immer zwei Teillisten zusammen und sortiere das Resultat \n 5. Wiederhole dies bis alle Karten sortiert in einem Stück sind",
  "Free Sort": "Deine Aufgabe ist es, die Karten in aufsteigender Reihenfolge zu sortieren. \n Die Karten enthalten Bilder mit Strichen. Kleiner bedeutet,dass eine Karte weniger Striche hat als eine andere. \n Du kannst die Karten in die leeren Felder ziehen und sie dort ablegen. \n Wenn du die Karten in die richtige Reihenfolge gebracht hast, klicke auf fertig sortiert, um zu überprüfen, ob du richtig sortiert hast."
}